INSERT INTO students (name, nickname, email, address, age, gender)
VALUES
('山田太郎', 'タロ', 'taro@example.com', '東京', 25, '男性'),
('鈴木一郎', 'イチ', 'ichiro@example.com', '大阪', 30, '男性'),
('田中花子', 'ハナ', 'hana@example.com', '北海道', 22, '女性'),
('佐藤良子', 'リョウ', 'ryoko@example.com', '福岡', 28, '男性'),
('伊藤春香', 'ハル', 'haruka@example.com', '愛知', 35, 'その他');

INSERT INTO students_courses (student_id, course_name, course_start_at, course_end_at)
VALUES
(1, 'Javaコース', '2023-04-01', '2024-04-01'),
(1, 'AWSコース', '2023-05-01', '2023-08-01'),
(2, 'デザインコース', '2023-06-01', '2023-09-01'),
(3, 'Web制作コース', '2023-07-01', '2023-10-01'),
(3, 'デザインコース', '2023-08-01', '2023-11-01'),
(3, 'マーケティングコース', '2023-09-01', '2024-01-01'),
(4, 'Javaコース', '2023-10-01', '2024-02-01'),
(4, 'マーケティングコース', '2023-11-01', '2023-03-01'),
(5, 'AWSコース', '2023-12-01', '2024-04-01'),
(1, 'Web制作コース', '2024-01-01', '2024-05-01');
